<?php
/* لديك ال Array التالية ومعها متغيرات آخرى لتساعدك
المطلوب طباعة النتيجة كما بالأسفل بإستخدام ما تعلمته
ممنوع نهائيا كتابة العناصر بنفسك ولا إضافة العناصر داخل ال Array بطريقة يدوية
ممنوع نهائيا إستخدام أي أرقام
يجب أن يكون الحل بسطر واحد فقط
*/
$chars = ["A", "B", "C", "D", "E"];
$char = "@@";
$zero = 0;

echo "<pre>";
print_r(array_pad($chars, count($chars) * strlen($char), $char[$zero]));
echo "</pre>";

/******************** */
// Array
// (
//   [0] => A
//   [1] => B
//   [2] => C
//   [3] => D
//   [4] => E
//   [5] => @
//   [6] => @
//   [7] => @
//   [8] => @
//   [9] => @
// )
/**************** */
//length = 10  ??!
// length($chars) = 5
// $charlength($char) =2
// $char[0] =@