<?php
/* 
لديك متغير index قيمته 0 لا تقم بالتعديل عليه
نريد أن تطبع الأرقام الزوجية فقط تحت بعضها من رقم 2 وحتى رقم 20
يجب عليك عمل ما سبق مرة بإستخدام ال While ومرة بإستخدام ال For ومرة بإستخدام ال Do While
*/
$index = 0;
/*****************/
// for ($index; $index < 20; $index += 2) {
//     echo $index + 2 . "<br>";
// }
/****************** */
// while ($index < 20) {
//     $index += 2;
//     echo $index . "<br>";
// }
/**************** */
do {
    $index += 2;
    echo $index . "<br>";
} while ($index < 20);
/***************** */
// 2
// 4
// 6
// 8
// 10
// 12
// 14
// 16
// 18
// 20