<?php
/* --------------------------------لديك متغير num قيمته رقم 2 لا تقم بالتعديل عليه ولا على الشرط الموجود داخل ال While
يجب عليك كتابة ال Code داخل ال Loop لتطبع الأرقام بنفس ال Pattern المطلوب
*/
// $num = 2;
// while ($num < 520) {
//   // Your Code Here
// }
/*************/
$num = 2;
while ($num < 520) {
// Your Code Here
    if ($num == 2)
        echo ($num / $num) . "<br>";//verified at first check
    echo ($num + 2) . "<br>";
    $num = ($num + 2) * 2;
}
/*************************/
// 1
// 4
// 10
// 22
// 46
// 94
// 190
// 382