<?php
/*
ممنوع إستخدام الأرقام نهائيا ويمكنك إستخدام قيم المتغيرات مع ما تعلمته لتنفيذ المطلوب
يجب طباعة الأرقام كما في المثال والتوقف عند الرقم 3
إذا كان الرقم اصغر من 10 قم بطباعة صفر قبله
يجب إستخدام ال Loop For لعمل المطلوب
*/
$start = 10;
$end = 0;
$stop = 3;
for (; $start >= $end; $start--) {
    if ($start == 10) {
        echo $start . "<br>";
    }
    else {
        echo "0$start <br>";
    }
    if ($start == $stop) {
        break;
    }
}
/*********** */
// Needed Output
// 10
// 09
// 08
// 07
// 06
// 05
// 04
// 03